Repository: alibasheer/woo-mpgs
Catalog: languages/woo-mpgs-*.po
Languages: fr_fr

source: Configure
fr_fr: Configurer

source: MPGS requires WooCommerce to be installed and active. You can download %s here.
fr_fr: Le MPGS exige que WooCommerce soit installé et actif. Vous pouvez télécharger %s ici.

source: Allows MasterCard Payment Gateway Services (MPGS)
fr_fr: Autorise les services de passerelle de paiement MasterCard (MPGS)

source: Enable/Disable
fr_fr: Activer/Désactiver

source: Enable MPGS Payment Module.
fr_fr: Activer le module de paiement MPGS.

source: Title
fr_fr: Titre

source: This controls the title for the payment method the customer sees during checkout.
fr_fr: Il contrôle le titre du mode de paiement que le client voit lors de la commande.

source: Credit Card
fr_fr: Carte de crédit

source: Payment method description that the customer will see on your checkout.
fr_fr: Description du mode de paiement

source: Pay securely by Credit/Debit Card.
fr_fr: Payez en toute sécurité par carte de crédit/débit.

source: Icon
fr_fr: Icône

source: Enter an image URL to change the icon.
fr_fr: Entrez une URL d'image pour changer l'icône.

source: MPGS URL
fr_fr: URL MPGS

source: MPGS URL, given by the Bank. This is an example: https://ap-gateway.mastercard.com/
fr_fr: URL MPGS, donnée par la Banque. Voici un exemple : https://ap-gateway.mastercard.com/

source: API Version
fr_fr: Version de l'API

source: API version, given by the Bank
fr_fr: Version API, donnée par la Banque

source: MPGS API Version (49 is recommended)
fr_fr: Version API du MPGS (49 est recommandé)

source: Merchant ID
fr_fr: Identification du commerçant

source: Merchant ID, given by the Bank
fr_fr: Identification du commerçant, délivrée par la banque

source: Authentication Password
fr_fr: Mot de passe d'authentification

source: Authentication Password, given by the Bank
fr_fr: Mot de passe d'authentification, donné par la Banque

source: Name
fr_fr: Nom

source: Merchant name that will appear in the gateway page or popup
fr_fr: Nom du commerçant qui apparaîtra dans la page d'accueil ou la fenêtre contextuelle

source: Merchant Address Line 1
fr_fr: Adresse du commerçant ligne 1

source: Merchant Address Line 1 that will appear in the gateway page or popup
fr_fr: Adresse du commerçant ligne 1 qui apparaîtra dans la page ou la fenêtre contextuelle de la passerelle

source: Merchant Address Line 2
fr_fr: Adresse du commerçant ligne 2

source: Merchant Address Line 2 that will appear in the gateway page or popup
fr_fr: Adresse du commerçant ligne 2 qui apparaîtra dans la page ou la fenêtre contextuelle de la passerelle

source: Checkout Interaction
fr_fr: Interaction à la commande

source: Choose checkout interaction type
fr_fr: Choisissez le type d'interaction à la phase de paiement de commande

source: Payment error: Failed to communicate with MPGS server. Make sure MPGS URL looks like `https://example.mastercard.com/` by removing `checkout/version/*/checkout.js` and end the URL with a slash "/".
fr_fr: Erreur de paiement : Échec de la communication avec le serveur MPGS. Assurez-vous que l'URL de MPGS ressemble à `https://example.mastercard.com/` en supprimant `checkout/version/*/checkout.js` et en terminant l'URL par une barre oblique "/".

source: Payment error:
fr_fr: Erreur de paiement :

source: Pay for order #%d via %s
fr_fr: Payer pour la commande #%d via %s

source: Loading payment method, please wait. This may take up to 30 seconds.
fr_fr: Chargement du mode de paiement, veuillez patienter. Cela peut prendre jusqu'à 30 secondes.

source: Payment error: Session not found.
fr_fr: Erreur de paiement : Session non trouvée.

source: MPGS Payment completed with Transaction Receipt: %s.
fr_fr: Paiement MPGS complété avec le reçu de la transaction: %s.

source: Payment error: Something went wrong.
fr_fr: Erreur de paiement : Quelque chose s'est mal passé.

source: Payment error: Invalid transaction.
fr_fr: Erreur de paiement : Transaction non valable.

source: Extends WooCommerce with MasterCard Payment Gateway Services (MPGS).
fr_fr: Extension de WooCommerce avec les services de passerelle de paiement de MasterCard (MPGS).
